app/controllers/diagnozas_controller.rb

SELECT "diagnozas".* FROM "diagnozas"
---
  def index
    @diagnozas = Diagnoza.all

INSERT INTO "diagnozas" ("created_at", "opis", "typ", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2017-01-08 11:03:19.186563"], ["opis", "Złamanie ręki w 2 miejscach"], ["typ", "złamanie"], ["updated_at", "2017-01-08 11:03:19.186563"]]
---
  def create
    @diagnoza = Diagnoza.new(diagnoza_params)

    respond_to do |format|
      if @diagnoza.save

SELECT  "diagnozas".* FROM "diagnozas"  WHERE "diagnozas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_diagnoza
      @diagnoza = Diagnoza.find(params[:id])