app/controllers/kartoteks_controller.rb

SELECT "kartoteks".* FROM "kartoteks"
---
  def index
    @kartoteks = Kartotek.all

INSERT INTO "kartoteks" ("created_at", "diagnoza_id", "lekarz_id", "pacjent_id", "updated_at", "wizyt_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2017-01-08 11:04:15.544669"], ["diagnoza_id", 1], ["lekarz_id", 1], ["pacjent_id", 1], ["updated_at", "2017-01-08 11:04:15.544669"], ["wizyt_id", 1]]
---
  def create
    @kartotek = Kartotek.new(kartotek_params)

    respond_to do |format|
      if @kartotek.save

SELECT  "kartoteks".* FROM "kartoteks"  WHERE "kartoteks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_kartotek
      @kartotek = Kartotek.find(params[:id])