app/controllers/lekarzs_controller.rb

  def index
    @lekarzs = Lekarz.all
---
SELECT "lekarzs".* FROM "lekarzs"

  def create
    @lekarz = Lekarz.new(lekarz_params)

    respond_to do |format|
      if @lekarz.save
---
INSERT INTO "lekarzs" ("created_at", "email", "haslo", "imie", "nazwisko", "nrTelefonu", "specjalizacja", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_lekarz
      @lekarz = Lekarz.find(params[:id])
---
SELECT  "lekarzs".* FROM "lekarzs"  WHERE "lekarzs"."id" = ? LIMIT 1  [["id", 1]]