app/controllers/pacjents_controller.rb

  def index
    @pacjents = Pacjent.all
---
SELECT "pacjents".* FROM "pacjents"

  def create
    @pacjent = Pacjent.new(pacjent_params)

    respond_to do |format|
      if @pacjent.save
---
INSERT INTO "pacjents" ("created_at", "email", "haslo", "imie", "nazwisko", "nrtelefonu", "pesel", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_pacjent
      @pacjent = Pacjent.find(params[:id])
---
SELECT  "pacjents".* FROM "pacjents"  WHERE "pacjents"."id" = ? LIMIT 1  [["id", 1]]