app/controllers/wizyts_controller.rb

  def index
    @wizyts = Wizyt.all
---
SELECT "wizyts".* FROM "wizyts"

  def create
    @wizyt = Wizyt.new(wizyt_params)

    respond_to do |format|
      if @wizyt.save
---
INSERT INTO "wizyts" ("created_at", "data", "lekarz_id", "pacjent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2017-01-08 11:03:42.694711"], ["data", "2017-01-08 11:03:00.000000"], ["lekarz_id", 1], ["pacjent_id", 1], ["updated_at", "2017-01-08 11:03:42.694711"]]

    def set_wizyt
      @wizyt = Wizyt.find(params[:id])
---
SELECT  "wizyts".* FROM "wizyts"  WHERE "wizyts"."id" = ? LIMIT 1  [["id", 1]]